<?

### 데이콤 (Noteurl_Link_PHP)

include "../conf/pg.dacom.php";
@include "../conf/pg.escrow.php";

// 투데이샵 사용중인 경우 PG 설정 교체
resetPaymentGateway();

$pg['zerofee']	= ( $pg['zerofee'] == "yes" ? '1' : '0' );			// 무이자 여부 (Y:1 / N:0)

///////////////////////////////////////////////////////////////////////////////////////////////////
// hashdata를 생성한다
//
//  *    hashdata 는 요청무결성을 검증하는 데이타로 요청시 필수 항목이며,
//               mid+oid+amount+mertkey 를 조합한후 md5 방식으로 생성한 해쉬값 입니다.
//
////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////
//  mertkey 확인 방법
//  1. 상점관리자(서비스: http://pgweb.dacom.net  테스트: http://pgweb.dacom.net/tmert) 접속
//  2. Dacom 에서 받은 테스트 아이디나 서비스 아이디로 로그인
//  3. 계약정보 -> 상점정보관리 -> 결과전송정보 에서 확인이 가능
////////////////////////////////////////////////////////////////////////////////////////////////////

$mid		= $pg['id'];			//Dacom 제공 상점아이디
$oid		= $_POST['ordno'];				//주문번호
$amount		= $_POST['settleprice'];			//결제금액
$mertkey	= $pg['mertkey'];		//데이콤에서 발급받은 키값

////////////////////////////// hashdata 생성 - 결제요청무결성검증 //////////////////////////////

$hashdata = md5($mid.$oid.$amount.$mertkey);

//////////////////////////////////////////////////////////////////////////////////////////////////

if(!preg_match('/mypage/',$_SERVER[SCRIPT_NAME])){
	$item = $cart -> item;
}

foreach($item as $v){
	$i++;
	if($i == 1) $ordnm = $v[goodsnm];
}
if($i > 1)$ordnm .= " 외".($i-1)."건";
?>