<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=euc-kr">
<title>올앳 에스크로(매매보호) 서비스 이용 약관</title>
<style><!--
body { font-family:굴림체; font-size:12px; background-attachment:fixed}
td   { font-family:굴림체; font-size:12px; height:22px;}
.title { font-family:굴림체; font-size:16px; }
.head { background-color:#EFF7FC; text-align:center;  }
.body { background-color:#FFFFFF; padding: 0 10 0 10  }
.nbody { background-color:#FFFFCC; padding: 0 10 0 10  }
//--></style>
</head>
<body>
<div>
올앳 에스크로(매매보호) 서비스 이용 약관<br>
<br>
제 1 조 (목 적)<br>
이 약관은 주식회사 올앳(이하, ‘올앳’이라 합니다)이 제공하는 에스크로(매매보호) 서비스(이하 서비스 라 함) 이용에 관한 사항에 대해 정함을 목적으로 합니다.<br>
<br>
제 2 조 (용어의 정의)<br>
이 약관에서 사용하는 용어의 정의는 다음과 같습니다. ① ‘쇼핑몰’ 이라 함은 쇼핑몰이 물품 등을 거래할 수 있도록 일정한 장소 또는 가상의 장소에 설치한 영업장을 말합니다.<br>
② ‘이용자’라 함은 계좌이체, 가상계좌 등 현금성 거래의 지불수단을 이용해, 쇼핑몰로부터 상품 등을 구매하고, 올앳 매매보호서비스를 이용하여 동 구매에 대한 대금을 결제하는 자를 말합니다.<br>
③ ‘표준 배송기간’ 이라 함은 쇼핑몰이 판매하는 물품이나 용역에 대해서 이용자가 구매대금을 입금완료(현금)하거나, 카드사로부터 승인을 통지(카드)받는 등 기타 수단에 의한 대금의 지불이 이뤄진 것으로 확인되는 시점에서부터 이용자에게 물품이나 용역을 배송 완료하는데 필요한 기일을 말합니다.<br>
④ ‘상품 확인기간’ 이라 함은 이용자가 물품의 배송이 완료된 후 본인이 구매하고자 하는 물품과 일치하는 지 확인하는 기간을 말합니다.<br>
⑤ ‘결제기관’이라 함은 이용자가 결제 수단별로 결제승인을 요청한 사항에 대하여 결제 승인여부를 제공하는 은행, 카드사 등의 기관을 말합니다.<br>
<br>
제 3 조 (서비스의 신청)<br>
① 본 서비스 이용을 위한 별도의 회원가입 절차는 필요하지 않으며, 고객이 쇼핑몰로부터의 물품 구매시 본 서비스를 이용한 결제 의사를 표시, 완료한 때 정당한 서비스 신청이 이루어진 것으로 합니다.<br>
② 본 서비스의 제공이 가능한 대상 물품의 범위는 이용자에 대한 배송 등에 관하여 에스크로 사업자가 확인할 수 있는 유형의 물품으로 실제 결제 금액 10만원 이상일 경우에 해당되며 이용자에게 일정기간에 걸쳐 분할되어 지급되는 물품 및 온라인 컨텐츠 등은 서비스 대상에서 제외됩니다.<br>
<br>
제 4 조 (서비스의 개시 시기)<br>
이용자의 서비스 신청에 따른 에스크로의 서비스 제공 및 책임의 개시 시기는 이용자의 구매 관련 정보가 쇼핑몰 등을 통해 올앳에 전달되고, 올앳이 위 결제대금의 입금이나 결제를 인지하는 때를 시점으로 합니다.<br>
<br>
제 5 조 (서비스의 종료 시기)<br>
본 서비스는 다음 각 호의 1에 해당하는 때에 종료됩니다.<br>
1. 이용자가 결제후 주문한 물품에 대하여 정상적으로 수령을 완료하고 쇼핑몰에 대금지급토록 구매 승인을 완료하였음을 올앳이 인지한 후 쇼핑몰 대금을 지급한 시점<br>
2. 이용자가 구매 후 올앳이 정한 상품 확인기간 내에 쇼핑몰앞 대금지급 여부에 대한 의사표시를 올앳으로 통지하지 아니하여 올앳이 쇼핑몰 물품대금을 지급한 시점<br>
3. 이용자가 구매 후 올앳이 정한 상품 확인기간 내에 구매 거절이나 취소의사를 통지하고, 쇼핑몰이 반품된 물품에 대한 수령을 완료하여 반품에 대한 이의가 없음을 통지한 경우 올앳이 정상적으로 구매 취소(반품)된 것으로 보고 거래대금을 이용자에게 환불한 시점.<br>
<br>
제 6 조 (서비스의 취소)<br>
이용자가 본 서비스를 통한 결제후 물품 발송 이전에 해당 쇼핑몰 등을 통해 구매 취소한 경우 올앳은 이용자가 서비스를 자동 취소한 것으로 간주하여 처리하며, 이에 대하여 올앳은 책임지지 아니합니다.<br>
<br>
제 7 조 (이용자의 의무)<br>
① 이용자는 공공질서, 미풍양속을 저해하는 물품의 구매나 계좌이체, 가상계좌 등 신용카드를 통한 불법 현금 거래, 융통 등 관계 법령을 위반하는 모든 행위는 이용자의 책임으로 합니다.<br>
② 이용자는 본 서비스 이용에 따른 약관 및 기타 관련 법령을 준수하여야 합니다.<br>
③ 이용자는 올앳에서 정한 기일이내에 상품 구매를 거절코자 하는 경우 동 구매 거절 의사를 제 11 조에 정한 방법에 따라 올앳에 통지하여야 합니다.<br>
<br>
제 8 조 (올앳의 의무)<br>
① 올앳은 서비스를 이용하고자 하는 이용자에게 올앳이 정한 절차에 따라 서비스를 제공할 의무가 있습니다.<br>
② 올앳은 이용자의 개인정보를 본인의 승낙 없이 타인에게 누설,배포하지 않습니다. 단, 법령에 의해 국가기관 등의 요구가 있는 경우는 그러하지 않습니다.<br>
<br>
제 9 조 (표준 배송기간 및 상품 확인기간)<br>
올앳은 이용자에게 배송개시일로부터 3일 또는 5일(상점과 올앳의 계약내용에 따라 상이함. 고객확인 이메일에서 확인가능함)이 경과한 날까지를 배송 물품의 정당, 파손 여부 등에 필요한 상품 확인 기간으로 부여하며, 위 기간이 경과하면 이용자가 구매를 확인한 것으로 간주하고 쇼핑몰에 대금을 지급합니다.<br>
<br>
제 10 조 (구매거절 의사의 통지)<br>
① 본 서비스 이용과 관련하여 이용자가 구매 거절코자 하는 경우, 이용자는 물품 구매일로부터 표준 배송기간에 상품 확인기간을 가산한 기일이내에 구매 물품에 대한 쇼핑몰 대금지급 거절 의사를 올앳이 사전에 정한 통지 방법에 따라 반드시 이용자 본인이 올앳에 통지하여야 합니다.<br>
<br>
제 11 조 (통지 방법 및 기한)<br>
① 대금지급 승인 및 구매 거절 의사에 대한 통지는 올앳이 이용자의 의사확인을 위하여 올앳의 홈페이지에 마련한 별도의 전산 프로그램을 통한 이용자 본인의 등록사항이 올앳에 정상적으로 도달함으로써 완료된 것으로 봅니다.<br>
② 이용자의 구매물품에 대한 쇼핑몰 대금 지급 승인 또는 구매 거절에 대한 통지기한은 물품 구매 후배송개시일로부터 상품 확인기간 마지막 기일의 자정(올앳 서버 시각 기준)까지로 합니다.<br>
③ 이용자는 쇼핑몰 대금지급 승인을 완료 하거나, 본 조 ② 항에서 정한 통지 기한을 경과한 이후에는 구매 거절을 할 수 없으며, 부득이 구매 거절코자 하는 경우에는 해당 쇼핑몰과 협의하여 처리하여야 합니다.<br>
<br>
제 12 조 (본인 확인 자료의 제출요구)<br>
올앳은 구매물품에 대한 쇼핑몰 대금지급 승인 또는 구매 거절행위와 관련하여, 본인 여부 및 정당한 의사 확인을 목적으로 서비스 이용자에 대하여 주민등록증 등 국가가 인정한 증명서의 사본 등의 제출을 요구할 수 있습니다.<br>
<br>
제 13 조 (쇼핑몰앞 대금의 지급)<br>
서비스의 제공과 관련하여 다음의 각 호의 경우 올앳은 쇼핑몰에게 물품 대금을 지급하며, 이에 대하여 이용자는 차후 물품 상이, 미수령, 반품, 파손 등의 사유로 올앳에 대하여 이의를 제기할 수 없습니다.<br>
① 이용자가 구매 물품에 대하여 쇼핑몰 대금지급을 승인한 경우<br>
② 이용자로부터 상기 제 11 조에서 정한 통지 기한 내 구매 물품에 대한 별도의 지급 거절의사를 통지하지 않은 경우<br>
<br>
제 14 조 (구매 거절에 따른 환불, 취소 )<br>
① 이용자의 구매 거절 의사 통지 및 이에 대한 쇼핑몰의 환불 승인이 완료된 경우에 올앳은 정산주기에 따라 해당건을 정산 처리합니다.<br>
② 이용자는 구매 거절 후 수령한 물품에 대한 쇼핑몰 반송 처리시 안전하게 반송될 수 있도록 하여야 하며, 만일 이용자의 귀책 사유로 물품이 훼손된 경우에는 이용자와 쇼핑몰간 상호 협의하여 처리하여야 합니다.<br>
<br>
제 15 조 (에스크로 사업자의 면책)<br>
올앳은 다음의 경우 서비스 제공에 따른 책임을 부담하지 아니합니다.<br>
① 구매한 물품의 하자 또는 배송 과정상의 파손 등으로 인한 분쟁 발생시<br>
② 이용자와 쇼핑몰간의 비정상적인 거래로 인한 손실 발생<br>
③ 천재지변, 전쟁, 파업, 결제기관의 업무중지, 기타 올앳의 불가항력적인 사유로 인한 서비스 장애 또는 중단에 따른 이용자의 손해<br>
<br>
제 16 조 (이용 시간)<br>
서비스의 이용시간은 연중무휴 1일 24시간을 원칙으로 하되, 에스크로 사업자의 사정에 따라서 이용 시간의 변경 또는 제한이 있을 수 있습니다.<br>
<br>
제 17 조 (서비스의 중단)<br>
올앳은 컴퓨터 등 관련 시스템의 보수 점검, 교체 및 고장, 통신 두절 등의 사유가 발생한 경우 서비스 제공을 일시적으로 중단할 수 있습니다.<br>
<br>
제 18 조 (거래내역의 보관)<br>
올앳은 대금의 정산관련 근거를 관련 법령에 따라 보관합니다.<br>
<br>
제 19 조 (손해배상의 범위)<br>
① 올앳과 이용자는 본 약관을 위반함으로써 발생하는 모든 책임을 각자가 부담하며, 이로 인해 상대방에게 손해를 입힌 경우에는 이를 배상하여야 합니다.<br>
② 올앳은 회원의 귀책사유로 인한 서비스 이용의 장애에 대해 책임을 지지 않습니다.<br>
<br>
제 20 조 (약관에 정하지 아니한 사항)<br>
이 약관에서 정하지 아니한 사항과 약관의 해석에 관하여는 전자거래 기본법, 전자상거래등에서의 소비자 보호에 관한 법률, 전자서명법 등 관계법령, 전자금융 거래 기본약관, 해당 쇼핑몰의 회원 약관 및 상관례에 따릅니다.<br>
<br>
제 21 조 (이의 제기)<br>
이용자가 서비스 이용과 관련하여 이의가 있을 경우에는 소비자 보호원 등을 통해 분쟁조정을 신청할 수 있습니다.<br>
<br>
제 22 조 (관할 법원)<br>
서비스 제공과 관련한 분쟁 발생시 관할법원은 올앳의 사무소 소재지 또는 이용자의 주소지 관할 법원을 관할 법원으로 합니다.
</div>

</body>
</html>