<?php /* Template_ 2.2.7 2014/09/03 11:02:59 /www/francotr3287_godo_co_kr/shop/conf/terms/termsPolicyCollection3.txt 000005033 */ ?>
1. 총칙
<?php echo $GLOBALS["cfg"]['shopName']?>는 이용자들의 개인정보보호를 매우 중요시하며, 이용자가 회사의 서비스를 이용함과 동시에 온라인상에서 <?php echo $GLOBALS["cfg"]['shopName']?>에 제공한 개인정보가 보호 받을 수 있도록 최선을 다하고 있습니다. 이에 <?php echo $GLOBALS["cfg"]['shopName']?>는 통신비밀보호법, 전기통신사업법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률 등 정보통신서비스제공자가 준수하여야 할 관련 법규상의 개인정보보호 규정 및 정보통신부가 제정한 개인정보보호지침을 준수하고 있습니다.
<?php echo $GLOBALS["cfg"]['shopName']?>는 개인정보 취급방침을 통하여 이용자들이 제공하는 개인정보가 어떠한 용도와 방식으로 이용되고 있으며 개인정보보호를 위해 어떠한 조치가 취해지고 있는지 알려 드립니다.
회사의 개인정보 취급방침은 정부의 법률 및 지침 변경이나 회사의 내부 방침 변경 등으로 인하여 수시로 변경될 수 있고, 이에 따른 개인정보 취급방침의 지속적인 개선을 위하여 필요한 절차를 정하고 있습니다. 그리고 개인정보 취급방침을 개정하는 경우나 개인정보 취급방침 변경될 경우 쇼핑몰의 첫 페이지의 개인정보취급방침을 통해 고지하고 있습니다. 이용자들께서는 사이트 방문 시 수시로 확인하시기 바랍니다.

2. 개인정보의 수집목적 및 이용목적
"개인정보"라 함은 생존하는 개인에 관한 정보로서 당해 정보에 포함되어 있는 성명, 휴대폰번호 등의 사항에 의하여 당해 개인을 식별할 수 있는 정보(당해 정보만으로는 특정 개인을 식별할 수 없더라도 다른 정보와 용이하게 결합하여 식별할 수 있는 것을 포함)를 말합니다.
대부분의 서비스는 별도의 사용자 등록이 없이 언제든지 사용할 수 있습니다. 그러나 <?php echo $GLOBALS["cfg"]['shopName']?>는 회원서비스를 통하여 이용자들에게 맞춤식 서비스를 비롯한 보다 더 향상된 양질의 서비스를 제공하기 위하여 다음과 같은 목적으로 이용자 개인의 정보를 수집 · 이용하고 있습니다. 

- 이메일, 휴대폰번호 : 고지사항 전달, 불만처리 등을 위한 원활한 의사소통 경로의 확보
- 성명, 주소, 전화번호 : 청구서, 물품배송 시 정확한 배송지의 확보 및 비회원구매에 따른 구매자 식별 절차에 이용
- IP Address : 불량회원의 부정 이용 방지와 비인가 사용 방지
기타 위 수집된 정보를 이용하여 서비스 제공에 관한 계약이행 및 요금정산에 활용하고 있습니다.

3. 수집하는 개인정보 항목 및 수집방법
<?php echo $GLOBALS["cfg"]['shopName']?>는 이용자들이 원활한 서비스를 이용하기 위해 기본적인 정보들을 온라인상에서 입력 받고 있습니다. 
<비회원 구매/게시글 등록>
이름, 전화번호, 휴대폰번호, 이메일, 주소
그러나, 이용자의 기본적 인권 침해의 우려가 있는 민감한 개인정보(인종 및 민족, 사상 및 신조, 출신지 및 본적지, 정치적 성향 및 범죄기록, 건강상태 및 성생활 등)는 수집하지 않으며 부득이하게 수집해야 할 경우 이용자들의 사전동의를 반드시 구할 것입니다. 그리고, 어떤 경우에라도 입력하신 정보를 이용자들에게 사전에 밝힌 목적 이외에 다른 목적으로는 사용하지 않으며 이용자의 사전 동의 없이는 이용자의 개인 정보를 외부에로 공개 · 유출하지 않습니다.

4. 비회원의 고객 개인정보 보호
<?php echo $GLOBALS["cfg"]['shopName']?>는 비회원 고객 또한 물품 및 서비스 상품의 구매를 하실 수 있도록 하고 있습니다. <?php echo $GLOBALS["cfg"]['shopName']?>는 비회원 주문의 경우 배송 및 대금 결제, 상품 배송에 반드시 필요한 개인정보만을 이용자에게 요청하고 있습니다.
<?php echo $GLOBALS["cfg"]['shopName']?>에서 비회원으로 구입을 하신 경우 비회원 이용자가 입력한 지불인 정보 및 수령인 정보는 대금 결제 및 상품 배송에 관련한 용도 외에는 다른 어떠한 용도로도 사용되지 않습니다.

5. 개인정보의 보유기간 및 이용기간
이용자가 쇼핑몰 비회원으로서 회사에 제공하는 서비스를 이용하는 동안 <?php echo $GLOBALS["cfg"]['shopName']?>는 이용자들의 개인정보를 계속적으로 보유하며 서비스 제공 등을 위해 이용합니다. 다만, 개인정보취급방침 전체 내용 중 "8. 개인정보의 열람, 정정, 삭제" 에서 설명한 절차와 방법에 따라 이용자 본인이 직접 삭제하거나 수정한 정보, 가입해지를 요청한 경우에는 재생할 수 없는 방법에 의하여 디스크에서 완전히 삭제하며 추후 열람이나 이용이 불가능한 상태로 처리됩니다.
그리고 "4. 수집하는 개인정보 항목 및 수집방법" 에서와 같이 일시적인 목적 (설문조사, 이벤트, 본인확인 등)으로 입력 받은 개인정보는 그 목적이 달성된 이후에는 동일한 방법으로 사후 재생이 불가능한 상태로 처리됩니다.
이용자의 개인정보는 다음과 같이 개인정보의 수집목적 또는 제공받은 목적이 달성되면 파기하는 것을 원칙으로 합니다. 
그리고 상법, 전자상거래 등에서의 소비자보호에 관한 법률 등 관계법령의 규정에 의하여 보존할 필요가 있는 경우 <?php echo $GLOBALS["cfg"]['shopName']?>는 관계법령에서 정한 일정한 기간 동안 회원정보를 보관합니다. 이 경우 <?php echo $GLOBALS["cfg"]['shopName']?>는 보관하는 정보를 그 보관의 목적으로만 이용하며 보존기간은 아래와 같습니다.

- 계약 또는 청약철회 등에 관한 기록 : 5년
- 대금결제 및 재화 등의 공급에 관한 기록 : 5년
- 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년

<?php echo $GLOBALS["cfg"]['shopName']?>는 귀중한 이용자의 개인정보를 안전하게 처리하며, 유출의 방지를 위하여 다음과 같은 방법을 통하여 개인정보를 파기합니다.
종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다. 전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.